# **Car Price Prediction**

# Business Problem Understanding
- To predict used car price based on previous data

In [31]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [32]:
import warnings
warnings.filterwarnings("ignore")

In [33]:
# n= int(input("enter a number"))
# for i in range (1,11):
#     print(n,"x",i,"=",i*n)

# Step 2 - Data Understanding

In [34]:
df = pd.read_csv("cardata.csv")
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [35]:
df.shape

(4340, 8)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4340 entries, 0 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4340 non-null   object
 1   year           4340 non-null   int64
 2   selling_price  4340 non-null   int64
 3   km_driven      4340 non-null   int64
 4   fuel           4340 non-null   object
 5   seller_type    4340 non-null   object
 6   transmission   4340 non-null   object
 7   owner          4340 non-null   object
dtypes: int64(3), object(5)
memory usage: 271.4+ KB

In [37]:
df['fuel'].value_counts() # Data Encoding Required

fuel
Diesel      2153
Petrol      2123
CNG           40
LPG           23
Electric       1
Name: count, dtype: int64

In [38]:
df['seller_type'].value_counts()

seller_type
Individual          3244
Dealer               994
Trustmark Dealer     102
Name: count, dtype: int64

In [39]:
df['transmission'].value_counts()

transmission
Manual       3892
Automatic     448
Name: count, dtype: int64

In [40]:
df['owner'].value_counts()

owner
First Owner             2832
Second Owner            1106
Third Owner              304
Fourth & Above Owner      81
Test Drive Car            17
Name: count, dtype: int64

In [41]:
continous = ['selling_price','km_driven']
df[continous].describe()

       selling_price      km_driven
count   4.340000e+03    4340.000000
mean    5.041273e+05   66215.777419
std     5.785487e+05   46644.102194
min     2.000000e+04       1.000000
25%     2.087498e+05   35000.000000
50%     3.500000e+05   60000.000000
75%     6.000000e+05   90000.000000
max     8.900000e+06  806599.000000

In [42]:
df[continous].corr()

               selling_price  km_driven
selling_price       1.000000  -0.192289
km_driven          -0.192289   1.000000

In [48]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,3,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,3,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,4,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,3,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,4,Individual,Manual,Second Owner

# Columns info
- **name** --> Car's model name
- **year** --> Car's models buying year
- **selling_price** --> Car's selling price 
- **km_driven** --> How many km car has drived
- **fuel** --> What is fuel type of car
- **seller_type** --> who is selling the car
- **transmission** --> Which type of gear system in  car
- **owner** --> how many previous owner

# Step 3 - Data Preprocessing
- Data cleaning

In [43]:
df.isnull().sum()

name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

In [44]:
df.duplicated().sum()

763

In [45]:
df.drop_duplicates(inplace=True)

In [46]:
df.duplicated().sum()

0

**Data Encoding**

In [47]:
# Replacing Fuel values with
# Diesel         4
# Petrol         3
# CNG            2
# LPG            1
# Electric       0

df['fuel'].replace({'Electric':0,
                    'LPG':1,
                    'CNG':2, 
                    'Petrol':3, 
                    'Diesel':4},inplace=True)

In [50]:
# Replacing seller_type with
# Individual           0
# Dealer               1
# Trustmark Dealer     2
df['seller_type'].replace({'Individual':0,
                            'Dealer' :1,
                            'Trustmark Dealer': 2}, inplace=True)

In [51]:
# Replacing transmission with
# Manual      0
# Automatic   1  
df['transmission'].replace({'Manual':0,
                            'Automatic':1}, inplace=True)

In [61]:
# Replacing owner with
# First Owner               0
# Second Owner              1
# Third Owner               2
# Fourth & Above Owner      3
# Test Drive Car            4
df['owner'].replace({'First Owner':0,
                            'Second Owner':1,
                            'Third Owner':2,
                            'Fourth & Above Owner':3,
                            'Test Drive Car':4},inplace= True)

In [63]:
df.drop('name', axis=1)

      year  selling_price  km_driven  fuel  seller_type  transmission  owner
0     2007          60000      70000     3            0             0      0
1     2007         135000      50000     3            0             0      0
2     2012         600000     100000     4            0             0      0
3     2017         250000      46000     3            0             0      0
4     2014         450000     141000     4            0             0      1
...    ...            ...        ...   ...          ...           ...    ...
4335  2014         409999      80000     4            0             0      1
4336  2014         409999      80000     4            0             0      1
4337  2009         110000      83000     3            0             0      1
4338  2016         865000      90000     4            0             0      0
4339  2016         225000      40000     3            0             0      0

[3577 rows x 7 columns]